#include <stdio.h>

// Булева алгебра

int main(int argc, char const *argv[])
{
	int a = 15;
	int b = 11;
	printf("a = %d, b = %d\n", a,b);

	a = a ^ b;
	// a = 15   00001111
	// b = 11   00001011
	// a ^ b =  00000100 (4)
	b = b ^ a;
	// b = 15   00001111
	// a = 11   00000100
	// b ^ a =  00001011 (11)
	a = a ^ b;
	// a = 15   00000100
	// b = 11   00001011
	// a ^ b =  00001111 (15)
	printf("a = %d, b = %d\n", a,b); // поменяли местами без 3й переменной

	// Сдвиги:
	// x << n = x * 2^n
	// b = 00001001 << 3 
	// b = 01001000 (72) 
	// x >> n = x / 2^n
	// b = 00001001 >> 3
	// b = 00000001 (1)
	
	return 0;
}